<template>
	<view>
		<u-navbar title-color="#000000" back-icon-color="#000000" :is-fixed="isFixed" :is-back="isBack"
			:background="background" :back-text-style="{color: '#fff'}" :title="title" :back-icon-name="backIconName"
			:back-text="backText" @click="newcreate"> 
			</u-navbar>
	到云隐私政策
	
	版本：1.0.7
	</br>
	</br>
	到云非常重视用户隐私政策并严格遵守相关的法律规定。请您仔细阅读《隐私政策》后再继续使用。如果您继续使用我们的服务，表示您已经充分阅读和理解我们协议的全部内容。
	
	到云尊重并保护所有用户的个人隐私权。为了给您提供更准确、更优质的服务，到云会按照本隐私政策的规定使用和披露您的个人信息。除本隐私政策另有规定外，在未征得您事先许可的情况下，到云不会将这些信息对外披露或向第三方提供。到云会不时更新本隐私政策。您在同意到云服务使用协议之时，即视为您已经同意本隐私政策全部内容。
	
	目录
	
	1. 定义
	
	2. 我们如何收集和使用您的信息
	
	3. 我们如何使用 Cookie
	
	4. 我们如何共享、转让、公开披露您的信息
	
	5. 我们使用的第三方 SDK 服务
	
	6. 我们如何存储您的个人信息
	
	7. 我们如何保护您的个人信息
	
	8. 您管理个人信息的权利
	
	9. 我们如何处理未成年人的个人信息保护
	
	10. 隐私政策的变更
	
	11. 联系我们
	
	 
	
	1. 定义
	
	1.1 我们：是指北京智启蓝墨信息技术有限公司，及由上述公司开发运营的到云 App 软件。
	
	1.2 个人信息（出自于 GB/T 35273-2017 《信息安全技术个人信息安全规范》）：是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本隐私政策中涉及的个人信息包括自然人的基本资料（包括姓名、出生年份、性别、电话号码、电子邮箱）、网络身份标识信息（包括系统账号、邮箱地址以及与前述有关的密码）、个人财产信息（包括虚拟货币、虚拟交易）、个人上网记录（包括网站浏览记录、软件使用记录、点击记录）、个人常用设备信息（包括硬件序列号、硬件型号、设备 MAC 地址、操作系统类型、唯一设备标识符）、个人位置信息（包括大概地理位置、精确定位信息）。我们实际具体收集的个人信息种类以下文描述为准。
	
	1.3 个人敏感信息（出自于 GB/T 35273-2017 《信息安全技术个人信息安全规范》）：是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本隐私政策中涉及的个人敏感信息包括您的个人财产信息、网络身份标识信息、精准定位信息。我们实际具体收集的个人敏感信息种类以下文描述为准。
	
	1.4 Cookie ：Cookie 是包含字符串的小文件，在您登入和使用网站或其他网络内容时发送、存放在您的计算机、移动设备或其他装置内（通常经过加密）。Cookie 同类技术是可用于与 Cookie 类似用途的其他技术，例如：Web Beacon、Proxy、嵌入式脚本。
	
	1.5 账号：当您注册账号并向我们提供一些个人信息，您就可以更好地使用我们的服务。当您访问到云时，系统会利用这些账号信息对您进行身份验证，以防止未经授权的人员访问您的账号。
	
	2. 我们如何收集和使用您的信息
	
	2.1 到云依据法律法规以及遵循正当、合法、必要的原则而收集和使用您在使用服务过程中主动提供或由于产品和服务需要而产生的个人信息。如果我们欲将您的个人信息用于本隐私政策未载明的其它用途，或基于特定目的将收集而来的信息用于其他目的，我们会及时以合理的方式向您告知，并在使用前再次征得您的同意。
	
	2.2 我们收集和使用的您的个人信息类型包括两种：第一种：我们产品与服务的核心业务功能所必需的信息：此类信息为产品与服务正常运行的必备信息，您须授权我们收集。如您拒绝提供，您将无法正常使用我们的产品与服务；第二种：附加业务功能可能需要收集的信息：此信息为非核心业务功能所需的信息，您可以选择是否授权我们收集。如您拒绝提供，将导致附加业务功能无法实现或无法达到我们拟达到的效果，但不影响您对核心业务功能的正常使用。
	
	2.3 我们会为实现下述各项功能，收集和使用您的个人信息：
	
	2.3.1 注册账号：当您注册到云账号时，我们会收集您的手机号码，用于完成注册并保护您的账号安全。手机号码属于敏感信息，为了获得更高效、可靠的登录凭证，我们将收集您的手机号码。您可以在注册完成后自行决定是否需要完善您的头像、姓名、昵称、性别、出生年份、学校、院系、身份、工号/学号、邮箱账号信息。如果您完善以上额外信息，将有助于我们为您提供更好的服务和体验。在上述额外信息中，如果您没有完善姓名和学号/工号信息，将会影响部分功能的使用，影响的功能包括：创建班课、加入班课。除此之外的其他信息若不提供，不会影响使用产品的基本功能。
	
	2.3.2 当您使用到云充值购买蓝豆（虚拟货币）时，我们会收集您的充值记录、消费记录信息，以便您查询自己的交易记录，同时尽最大程度保护您的财产、虚拟财产安全。上述信息属于敏感信息，但收集上述信息为实现相关功能所必须，否则将无法完成交易。
	
	2.3.3 基于相机/摄像头的附加服务：您可在开启相机/摄像头权限后使用资源和活动拍照上传功能、更换头像、更换班课封面、扫码投屏、私聊拍照发送图片、课程圈拍照发布日志。
	
	2.3.4 基于相册（图片库/视频库）的图片/视频访问及上传的附加服务：您可以在开启权限后使用相关功能上传您的图片/视频，以实现更换头像、更换班课封面、课程圈发布图片日志、发布图片/视频类资源、在活动中提交图片/视频类附件、私聊发送图片/视频类消息。
	
	2.3.5 基于麦克风语音技术的附加服务：您使用语音录制上传资源/附件或发送语音消息时，我们会请求您授权麦克风权限，我们会收集您的语音内容，因为收集是实现该功能所必需的。我们会请求您的麦克风权限并收集您的语音内容。
	
	2.3.6 基于文件存储（相册/存储卡读取权限）的图片/视频/本地数据库数据保存的服务：您可以在开启权限后使用相关功能将图片/视频资源保存到您的相册/本地存储中，可以将网络数据缓存到您的本地数据库中，节省数据流量。
	
	2.3.7 当您在使用过程中出现程序崩溃时，为了优化您的使用体验，我们会采集并上报您的崩溃日志，iOS端会采集设备型号、系统版本信息，Android 设备中会由腾讯 Bugly （第三方）收集和反馈您的崩溃信息， Bugly 会采集您的设备信息。
	
	2.3.8 基于地理位置信息的服务：您使用签到或者设置院系功能时，我们会请求地理位置信息权限，因为获取此项是实现该功能所必需的，在选择学校/院系功能中，我们会将您的地理位置信息传递给高德地图 SDK 用于 POI 搜索，以获取您附近的院校信息。如果您是 Android 用户，在使用签到功能时，高德地图 SDK 会获取您的地理位置信息，仅用于计算发起签到的老师与参与签到的学生之间的距离。
	
	2.3.9 以下情形中，我们收集、使用您的个人信息不必征得您的授权同意:
	
	1)   与个人信息控制者履行法律法规规定的义务相关的；
	
	2)   与国家安全、国防安全直接相关的；
	
	3)   与公共安全、公共卫生、重大公共利益直接相关的；
	
	4)   与刑事侦查、起诉、审判和判决执行等直接相关的；
	
	5)   出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；
	
	6)   所涉及的个人信息是个人信息主体自行向社会公众公开的；
	
	7)   根据个人信息主体要求签订和履行合同所必需的；
	
	8)   从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
	
	9)   维护所提供产品或服务的安全稳定运行所必需的，如发现、处置产品或服务的故障；
	
	3. 我们如何使用 Cookie
	
	3.1 在您未拒绝接受 Cookie 的情况下，到云会在您的计算机上设定或取用 Cookie，数据信息都采用匿名的方式，以便您能登录或使用依赖于 Cookie 的到云平台服务或功能。
	
	3.2 您有权选择接受或拒绝接受 Cookie 。您可以通过修改浏览器设置的方式拒绝接受 Cookie。但如果您选择拒绝接受 Cookie，您可能无法登录或使用依赖于 Cookie 的到云网络服务或功能。
	
	3.3 通过到云所设 Cookie 所取得的有关信息，将适用本政策。
	
	4. 我们如何共享、转让、公开披露您的信息
	
	4.1 共享
	
	4.1.1 我们不会与任何第三方公司、组织和个人共享您的个人信息，除非获得您的明确同意。我们仅会处于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途，对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协议，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息，并且我们会要求合作伙伴提供数据安全能力和信息安全资质（等级保护测评、信息安全管理体系）说明。在个人敏感数据使用上，我们要求第三方采用数据脱敏加密技术，从而更好地保护用户数据。如果您对第三方使用您的个人信息有异议或发现这些第三方开发的应用程序存在风险时，我们建议您终止相关操作以保护您的合法权益，您还可以与相应的第三方协商解决，我们将尽可能提供帮助。如果我们在此过程中违反法律法规的规定，给您造成损失的，我们将承担因此引起的相应责任。
	
	4.1.2 我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。如果我们在此过程中违反法律法规的规定，给您造成损失的，我们将承担因此引起的相应责任。
	
	4.2 转让
	
	4.2.1 我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
	
	1)   获得明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
	
	2)   根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供；
	
	3)   在涉及合并、收购、资产转让或类似的交易时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私政策的约束，否则，我们将要求该公司、组织重新向您征求授权同意。
	
	4.3 公开披露
	
	4.3.1 在我们每年举办的年度“魅力教师”评选活动中，我们会将获奖教师的姓名和学校信息进行公示。在公示之前，我们会告知获奖教师公示信息的目的和类型并征得其明确同意。除此之外，原则上，我们不会将您的个人信息进行公开披露。确有披露必要时，我们会告知您公开披露的目的、披露的个人信息类型、涉及的个人敏感信息种类，并征得您的明确同意，且采取符合业界标准的安全防护措施的前提下，才会公开披露您的个人信息。如果我们在此过程中违反法律法规的规定，给您造成损失的，我们将承担因此引起的相应责任。
	
	4.3.2 根据相关法律法规及国家标准，在以下情形中，我们可能会依法共享、转让、公开披露您的个人信息无需

	</view>
	

</template>

<script>
	
	export default {
		data() {
			return {
				title: '隐私政策',
				tabbar: '',
				backText: '返回',
				backIconName: 'nav-back',
				right: false,
				showAction: false,
				rightSlot: false,
				isBack: true,
				isFixed: true,
				arrow: true,
				background: {
					'background-image': 'linear-gradient(45deg, rgb(255, 255, 255), rgb(255, 255, 255))'
				},
				checked:true,
				classid: null,
				}
				}
				}
</script>

<style>
</style>
